import pandas as pd
import matplotlib.pyplot as plt

data = {
    'Ученик': ['Иван', 'Сергей', 'Алексей', 'Мария', 'Виктор', 'Анна', 'Михаил', 'Александр', 'Дмитрий', 'Егор'],
    'Математика': [4, 5, 5, 3, 4, 5, 5, 5, 4, 5],
    'Физика': [3, 5, 4, 3, 4, 4, 5, 5, 4, 3],
    'Химия': [5, 4, 5, 3, 5, 5, 4, 5, 4, 4],
    'Биология': [4, 3, 5, 3, 4, 5, 4, 5, 4, 3],
    'Информатика': [5, 5, 5, 3, 5, 5, 4, 5, 4, 5]
}

df = pd.DataFrame(data)

print(df)
print(df.describe())

print(f'Средняя успеваемость по математике - {df["Математика"].mean()}')
print(f'Медианная успеваемость по математике - {df["Математика"].median()}')
print(f'Мода успеваемости по математике - {df["Математика"].mode()}')
print(f'Стандартное отклонение успеваемости по математике - {df["Математика"].std()}')



print(f'Средняя успеваемость по физике - {df["Физика"].mean()}')
print(f'Медианная успеваемость по физике - {df["Физика"].median()}')
print(f'Стандартное отклонение успеваемости по физике - {df["Физика"].std()}')

print(f'Средняя успеваемость по химии - {df["Химия"].mean()}')
print(f'Медианная успеваемость по химии - {df["Химия"].median()}')
print(f'Стандартное отклонение успеваемости по химии - {df["Химия"].std()}')

print(f'Средняя успеваемость по биологии - {df["Биология"].mean()}')
print(f'Медианная успеваемость по биологии - {df["Биология"].median()}')
print(f'Стандартное отклонение успеваемости по биологии - {df["Биология"].std()}')

print(f'Средняя успеваемость по информатике - {df["Информатика"].mean()}')
print(f'Медианная успеваемость по информатике - {df["Информатика"].median()}')
print(f'Стандартное отклонение успеваемости по информатике - {df["Информатика"].std()}')


Q1_math = df['Математика'].quantile(0.25)
Q3_math = df['Математика'].quantile(0.75)
IQR_math = Q3_math - Q1_math

downside = Q1_math - 1.5 * IQR_math
upside = Q3_math + 1.5 * IQR_math

df_new = df[(df['Математика'] >= downside) & (df['Математика'] <= upside)]

df_new.boxplot(column='Математика') # диаграмма с усами
plt.show()